#include <s3c2440.h>
#include "gui.h"
#include "sys.h"
#include "LCD.h"

/*******************************************************
 * 函数名称：GPB_Conf
 * 描述说明：GPB引脚配置函数
 * 输入参数：无
 * 输出参数：无
*******************************************************/
void GPB_Conf()
{
	GPBCON = 0x155555;				// 设置GPB为输出属性
	GPBUP = 0x7FF;					// 禁止GPB端口的上拉	
}

/*******************************************************
 * 函数名称：delay
 * 描述说明：延时
 * 输入参数：unsigned int t要延时的周期数
 * 输出参数：无
*******************************************************/
void delay(unsigned int t)
{
	unsigned int i;
	for(;t>0;t--)
	{
		for(i=0;i<10000;i++)
		{}
	}
}

/*******************************************************
 * 函数名称：Led_Out
 * 描述说明：LED输出显示函数
 * 输入参数：data传递给LED灯的控制信号：1亮/0灭
 * 输出参数：无
 * 备    注：该函数控制连接在GPB5~8的4个LED灯点亮或熄灭 
*******************************************************/ 
void Led_Out(int data)
{
    GPBDAT = (GPBDAT & ~(0xf<<5)) | ((~data & 0xf)<<5); 
}

/*******************************************************
 * 函数名称：LED_Test
 * 描述说明：LED流水灯
 * 输入参数：无
 * 输出参数：无
*******************************************************/ 
void LED_Test(void)
{
	uint8 i;
	GPB_Conf();						// GPIO初始化
	
//	Paint_Bmp(0, 0, 240, 320, bg);	// 页面切换
	Lcd_printf(30, 100, RGB(0x00,0x00,0x00),RGB(0xff,0xff,0xff),0,"正在进行流水灯显示");
	
	for(i=0; i<10; i++)
	{
		Lcd_printf(30, 125, RGB(0x00,0x00,0x00),RGB(0xff,0xff,0xff),1,"循环显示10次，当前第%d次", i+1);				
		if (i == 9)
			Lcd_printf(30, 200, RGB(0xff,0x00,0x00),RGB(0xff,0xff,0xff),1,"即将退出...", i);	
		
		Led_Out(0x01);				// LED1点亮
		delay(3000);
		Led_Out(0x02);				// LED2点亮
		delay(3000);
		Led_Out(0x04);				// LED3点亮
		delay(3000);
		Led_Out(0x08);				// LED4点亮
		delay(3000);
		Led_Out(0x0F);				// LED全亮
		delay(3000);
		Led_Out(0x00);				// LED全灭
		delay(3000);
	}
}
