#include "sys.h"
#include "LCD.h"
#include "adc.h"
#include "gui.h"
#include <string.h>
#include <stdio.h>
#include <S3C2440.H>

#pragma  diag_suppress 870

#define  INPUT_PY    0		// Æ´ÒôÊäÈë·¨
#define  INPUT_EN    1		// Ó¢ÎÄÊäÈë·¨
#define  CTRL_A      1      // ÊäÈë·¨ÇÐ»»
#define  KEY_BACK    8		// ºóÍË¼ü¼üÖµ

uint8 mode = INPUT_PY;		// ÊäÈëÄ£Ê½
char py_buf[10] = "" ;		// Æ´ÒôÊäÈë»º´æ
char py_pt = 0;				// Æ´ÒôÊäÈëÖ¸Õë
char buf[100] = {0};		// ÏÔÊ¾»º´æ
char buf_pt = 0;			// »º´æÖ¸Õë
char *hz, *tmp;

char *Find_PY(char py_input[]);

/*****************************************************************
 * º¯ Êý Ãû£ºInput_Disp
 * ¹¦ÄÜÃèÊö£ºÏÔÊ¾µ±Ç°ÎªÖÐÎÄÊäÈë»òÓ¢ÎÄÊäÈë
 * ÊäÈë²ÎÊý£ºÎÞ
 * ·µ »Ø Öµ£ºÎÞ
*****************************************************************/
void Input_Disp(void)
{
	// »æÖÆÊäÈë·¨ÏÔÊ¾Çø
	GUI_FillRect(15, 245, 225, 270, RGB(233,243,250));
	GUI_DrawRect(15, 245, 225, 270, RGB(166,181,190));
	
	if(mode == INPUT_PY)
		Lcd_printf(18,250,RGB(81, 148, 210),RGB( 0xFF,0xFF,0xFF),0,"Æ´ÒôÊäÈë");
	else
		Lcd_printf(18,250,RGB(81, 148, 210),RGB( 0xFF,0xFF,0xFF),0,"Ó¢ÎÄÊäÈë");
}

char HZ_Buf[3];

/*****************************************************************
 * º¯ Êý Ãû£ºGet_HZ
 * ¹¦ÄÜÃèÊö£º´ÓÆ¥ÅäµÄºº×Ö´®ÌáÈ¡Ö¸¶¨ºº×Ö
 * ÊäÈë²ÎÊý£ºbuf--²éÑ¯Æ¥ÅäµÄºº×Ö´®Ö¸Õë£¬i--ÌáÈ¡µÚi¸öºº×Ö
 * ·µ »Ø Öµ£º1--³É¹¦£¬0--ÎÞºº×Ö
*****************************************************************/
uint8 Get_HZ(char *buf, uint8 i)
{
	uint8 HZ_num;

	HZ_num = strlen(buf)/2;		// Æ¥Åäºº×ÖµÄ¸öÊý
	Uart_Printf("HZ_num:%d\n",HZ_num);

	if(buf[i*2] > 0xa0 && buf[i*2+1] > 0xa0 && (i<=HZ_num))
	{		
		HZ_Buf[0] = buf[i*2];
		HZ_Buf[1] = buf[i*2+1];
		HZ_Buf[2] = 0;
		return 1;
	}
	else
		return 0;

}

/*****************************************************************
 * º¯ Êý Ãû£ºDisp_PY
 * ¹¦ÄÜÃèÊö£ºÊäÈë·¨ÏÔÊ¾Æ´Òô×Ö´®¼°Æ¥Åäºº×Ö
 * ÊäÈë²ÎÊý£ºÎÞ
 * ·µ »Ø Öµ£º1--³É¹¦; 0--ÎÞºº×Ö,Ö»ÏÔÊ¾Æ´Òô×Ö´®
*****************************************************************/
int Disp_PY()
{
	uint8 i;
	uint8 offset=0;
	// ÏÔÊ¾ÓÃ»§ÊäÈëµÄÆ´Òô×Ö·û
	Lcd_printf(18,250,RGB(81,148,210),RGB(233,243,250),1,"%-26s",py_buf );	
	
	if(hz== 0)			// Ã»ÓÐÕÒµ½ÓëÊäÈëÆ´Òô×Ö·ûÆ¥ÅäµÄºº×Ö£¬·µ»Ø
		return 0;

	offset += 7*8;
	for(i= 0; i<4; i++ )
	{
		if(Get_HZ(hz, i))
			Lcd_printf( 18+offset,250,RGB(81,148,210),RGB(233,243,250),1,"%d.%s ",i+1,HZ_Buf );	
		offset += 36; 
	} 
	return 1;
}

/*****************************************************************
 * º¯ Êý Ãû£ºPY_Init
 * ¹¦ÄÜÃèÊö£ºÏÔÊ¾Æ´ÒôÊäÈëÖ÷½çÃæ
 * ÊäÈë²ÎÊý£ºÎÞ
 * ·µ »Ø Öµ£ºÎÞ
*****************************************************************/
void PY_Init(void)
{
	Paint_Bmp(0, 0, 240, 320, bg);		// Ò³ÃæÇÐ»»

	// Ò³ÃæÎÄ×ÖÏÔÊ¾
	Lcd_printf(5,75,RGB( 0x00,0x00,0x00),RGB( 0xFF,0xFF,0xFF),0,"Æ´ÒôÊäÈë·¨²âÊÔ"  );
	Lcd_printf(15,100,RGB( 0x00,0x00,0x00),RGB( 0xFF,0xFF,0xFF),0,"1. ´ò¿ªDNW£¬´Ó´®¿ÚÊäÈëÆ´Òô"  );
	Lcd_printf(15,125,RGB( 0x00,0x00,0x00),RGB( 0xFF,0xFF,0xFF),0,"2. Ctrl+a£¬ÊµÏÖÖÐÓ¢ÎÄÇÐ»»"  );
	Lcd_printf(5,150,RGB( 0x00,0x00,0x00),RGB( 0xFF,0xFF,0xFF),0,"ÎÄ±¾ÊäÈëÇø£º"  );
	
	// »æÖÆÊäÈëÎÄ±¾ÏÔÊ¾Çø
	GUI_FillRect(15, 175, 225, 225, RGB(244,249,253));
	GUI_DrawRect(15, 175, 225, 225, RGB(0x00,0x00,0x00));
	
	// »æÖÆÊäÈë·¨ÏÔÊ¾Çø
	Input_Disp();
}

/*****************************************************************
 * º¯ Êý Ãû£ºPY_Input
 * ¹¦ÄÜÃèÊö£º´Ó´®¿ÚÊäÈëÆ´Òô²¢ÏÔÊ¾
 * ÊäÈë²ÎÊý£ºÎÞ
 * ·µ »Ø Öµ£ºÎÞ
*****************************************************************/
int PY_Input()
{
	char key;

	// ´Ó´®¿Ú»ñÈ¡°´¼üÖµ£¬ÎÞ¼üÔò·µ»Ø
	if((key = Uart_GetByte()) == 0)	
		return 0;
	Uart_Printf("key:%c, key_no:%x\n", key, key);

	if( key == CTRL_A )				// ÖÐÓ¢ÎÄÄ£Ê½ÇÐ»»
	{
		if( mode == INPUT_PY )
			mode = INPUT_EN ;
		else
			mode = INPUT_PY ;
		
		py_pt = 0;
		py_buf[0] = '\0';
		hz = 0;
		Input_Disp();

		return 0;
	}

	// Ó¢ÎÄÊäÈë
	if( mode== INPUT_EN )				
	{
		if(key == KEY_BACK)			//ÍË¸ñ¼ü
		{			
			if(buf_pt == 0)
			{
				buf[0]= '\0';
			}
			else
			{
				buf_pt--;
				buf[buf_pt]= '\0';			
			}
			Uart_Printf("buf:%s, buf_pt:%d\n",buf,buf_pt);
		}
		else	
		{
			buf[buf_pt] = key;
			buf_pt++;
			buf[buf_pt]= '\0';
			Uart_Printf("buf:%s, buf_pt:%d\n",buf,buf_pt);
		}
		Lcd_printf(17, 180, RGB( 0x00,0x00,0x00), RGB(244,249,253), 1, "%-26s", buf);
		
		return 1;
	}
	else									// ÖÐÎÄÊäÈëÄ£Ê½
	{
		if( key >= 'a' && key <= 'z' )		// ÊäÈë×ÖÄ¸
		{
			if(py_pt < sizeof(py_buf)-1)
			{
				py_buf[py_pt]= key;
				py_pt++;
				py_buf[py_pt]= 0;
				Uart_Printf("py_buf:%s, py_pt:%d\n",py_buf, py_pt);

				hz = Find_PY(py_buf);
				tmp = hz;
				Disp_PY();			// ÔÚÆ´ÒôÊäÈëÇøÏÔÊ¾²éÑ¯½á¹û
				return 1;
			}
			else 
				return 0;
		}
		else if( key == KEY_BACK )		// ÍË¸ñ¼ü
		{
			if(py_pt == 0)				// ÊäÈëÆ´Òô×Ö´®Îª¿Õ
			{
				py_buf[0]= '\0';
			}
			else
			{
				py_pt--;
				py_buf[py_pt]= '\0';
				hz = Find_PY(py_buf);	// ÊäÈëÆ´Òô×Ö´®²»Îª¿Õ£¬²éÕÒÆ¥Åäºº×Ö
				tmp = hz;			
				Disp_PY();				// ÔÚÆ´ÒôÊäÈëÇøÏÔÊ¾²éÑ¯½á¹û
			}
			Uart_Printf("py_buf:%s, py_pt:%d\n",py_buf, py_pt);
			return 1;
		}
		else if((key>='1' && key<='4') || key == ' ')	
		{	
			// Êý×Ö¼ü»ò¿Õ¸ñ¼ü£¬Ñ¡Ôñºº×Ö
			if(key == ' ')
				key = '1';

			if(Get_HZ(hz,key-'0'-1))
			{
				buf[buf_pt] = HZ_Buf[0];
				buf[buf_pt+1] = HZ_Buf[1];
				buf_pt += 2;
				buf[buf_pt]= '\0';

				py_pt = 0 ;
				py_buf[0]= 0;
				Lcd_printf(17, 180, RGB(0x00,0x00,0x00), RGB(244,249,253), 1, "%-26s", buf);		 
				Input_Disp();
				return 1;
			}
			else
				return 0;
		}
		else if(key=='+' || key =='=')	//Ïòºó·­Ò³	
		{
			if( strlen(hz)> 4*2 && *hz>0xa0 )
			{
				hz += 4*2;
				Disp_PY(); 			//ÏÔÊ¾·­Ò³ºóµÄºº×Ö
			}
			Uart_Printf("hz:%d\n", hz);
			Uart_Printf("tmp:%d\n", tmp);			
		}
		else if( key == '-' || key == '_')	//ÏòÇ°·­Ò³
		{
			if(tmp < hz)
			{
				hz-= 4*2;
				Disp_PY() ;		
			}		  
			Uart_Printf("hz:%d\n", hz);
			Uart_Printf("tmp:%d\n", tmp);	
		}
	}
	return 0;		
}

void PY_Test(void)
{
	PY_Init();						//Æ´ÒôÊäÈëÖ÷½çÃæ
	while(1)
	{
		PY_Input();
	}
}

typedef struct nt_PYCode
{
	char py[8];			// Æ´Òô
	char *hz ;			// ºº×Ö
}nt_PYCode;

nt_PYCode const PYCode[]=
{
	{"a     ","°¢°¡"},
	{"ai    ","°¥°§°¦°£°¤°¨°©°«°ª°¬°®°¯°­"},
	{"an    ","°²°±°°°³°¶°´°¸°·°µ"},
	{"ang   ","°¹°º°»"},
	{"ao    ","°¼°½°¾°¿°À°Á°Â°Ä°Ã"},
	//----------------------------------------
	{"ba    ","°Ë°Í°È°Ç°É°Å°Ì°Æ°Ê°Î°Ï°Ñ°Ð°Ó°Ö°Õ°Ô"},
	{"bai   ","°×°Ù°Û°Ø°Ú°Ü°Ý°Þ"},
	{"ban   ","°â°à°ã°ä°ß°á°å°æ°ì°ë°é°ç°è°í°ê"},
	{"bang  ","°î°ï°ð°ó°ñ°ò°ö°ø°ô°ù°õ°÷"},
	{"bao   ","°ü°ú°û°ý±¢±¦±¥±£±¤±¨±§±ª±«±©±¬°þ±¡ÆÙ"},
	{"bei   ","±°±­±¯±®±±±´±·±¸±³±µ±¶±»±¹±º±²"},
	{"ben   ","±¼±¾±½±¿º»"},
	{"beng  ","±À±Á±Â±Ã±Å±Ä"},
	{"bi    ","±Æ±Ç±È±Ë±Ê±É±Ò±Ø±Ï±Õ±Ó±Ñ±Ý±Ð±Ö±Ô±Í±×±Ì±Î±Ú±Ü±Û"},
	{"bian  ","±ß±à±Þ±á±â±å±ã±ä±é±æ±ç±è"},
	{"biao  ","±ë±ê±ì±í"},
	{"bie   ","±ï±î±ð±ñ"},
	{"bin   ","±ö±ò±ó±õ±ô±÷"},
	{"bing  ","±ù±ø±û±ü±ú±þ±ý²¢²¡"},
	{"bo    ","²¦²¨²£²§²±²¤²¥²®²µ²¯²´²ª²¬²°²©²³²«²­²²²·"},
	{"bu    ","²¹²¸²¶²»²¼²½²À²¿²º²¾"},
	//----------------------------------------
	{"ca    ","²Á"},
	{"cai   ","²Â²Å²Ä²Æ²Ã²É²Ê²Ç²È²Ë²Ì"},
	{"can   ","²Î²Í²Ð²Ï²Ñ²Ò²Ó"},
	{"cang  ","²Ö²×²Ô²Õ²Ø"},
	{"cao   ","²Ù²Ú²Ü²Û²Ý"},
	{"ce    ","²á²à²Þ²â²ß"},
	{"ceng  ","²ã²äÔø"},
	{"cha   ","²æ²å²é²ç²è²ë²ì²ê²í²ï²îÉ²"},
	{"chai  ","²ð²ñ²ò"},
	{"chan  ","²ô²ó²÷²ö²ø²õ²ú²ù²û²ü"},
	{"chang ","²ý²þ³¦³¢³¥³£³§³¡³¨³©³«³ª"},
	{"chao  ","³­³®³¬³²³¯³°³±³³³´´Â"},
	{"che   ","³µ³¶³¹³¸³·³º"},
	{"chen  ","³»³¾³¼³À³Á³½³Â³¿³Ä³Ã"},
	{"cheng ","³Æ³Å³É³Ê³Ð³Ï³Ç³Ë³Í³Ì³Î³È³Ñ³Ò³Ó"},
	{"chi   ","³Ô³Õ³Ú³Ø³Û³Ù³Ö³ß³Þ³Ý³Ü³â³à³ã³á"},
	{"chong ","³ä³å³æ³ç³è"},
	{"chou  ","³é³ð³ñ³ë³î³í³ï³ê³ì³ó³ò³ô"},
	{"chu   ","³ö³õ³ý³ø³ü³ú³û³÷³ù´¡´¢³þ´¦´¤´¥´£Ðó"},
	{"chuai ","´§"},
	{"chuan ","´¨´©´«´¬´ª´­´®"},
	{"chuang","´³´¯´°´²´´"},
	{"chui  ","´µ´¶´¹´·´¸"},
	{"chun  ","´º´»´¿´½´¾´¼´À"},
	{"chuo  ","´Á"},
	{"ci    ","´Ã´Ê´Ä´É´È´Ç´Å´Æ´Ë´Î´Ì´Í"},
	{"cong  ","´Ñ´Ó´Ò´Ð´Ï´Ô"},
	{"cou   ","´Õ"},
	{"cu    ","´Ö´Ù´×´Ø"},
	{"cuan  ","´Ú´Ü´Û"},
	{"cui   ","´Þ´ß´Ý´à´ã´á´â´ä"},
	{"cun   ","´å´æ´ç"},
	{"cuo   ","´ê´è´é´ì´ë´í"},
	//----------------------------------------
	{"da    ","´î´ï´ð´ñ´ò´ó"},
	{"dai   ","´ô´õ´ö´ú´ø´ýµ¡´ù´û´ü´þ´÷"},
	{"dan   ","µ¤µ¥µ£µ¢µ¦µ¨µ§µ©µ«µ®µ¯µ¬µ­µ°µª"},
	{"dang  ","µ±µ²µ³µ´µµ"},
	{"dao   ","µ¶µ¼µºµ¹µ·µ»µ¸µ½µ¿µÁµÀµ¾"},
	{"de    ","µÃµÂµÄ"},
	{"deng  ","µÆµÇµÅµÈµËµÊµÉ"},
	{"di    ","µÍµÌµÎµÒµÏµÐµÓµÑµÕµ×µÖµØµÜµÛµÝµÚµÞµÙ"},
	{"dian  ","µàµáµßµäµãµâµçµèµéµêµæµëµíµìµîµå"},
	{"diao  ","µóµðµòµïµñµõµöµô"},
	{"die   ","µùµøµüµýµþµúµû"},
	{"ding  ","¶¡¶£¶¢¶¤¶¥¶¦¶©¶¨¶§"},
	{"diu   ","¶ª"},
	{"dong  ","¶«¶¬¶­¶®¶¯¶³¶±¶²¶°¶´"},
	{"dou   ","¶¼¶µ¶·¶¶¶¸¶¹¶º¶»"},
	{"du    ","¶½¶¾¶Á¶¿¶À¶Â¶Ä¶Ã¶Ê¶Å¶Ç¶È¶É¶Æ"},
	{"duan  ","¶Ë¶Ì¶Î¶Ï¶Ð¶Í"},
	{"dui   ","¶Ñ¶Ó¶Ô¶Ò"},
	{"dun   ","¶Ö¶Ø¶Õ¶×¶Ü¶Û¶Ù¶Ý"},
	{"duo   ","¶à¶ß¶á¶Þ¶ä¶â¶ã¶ç¶é¶æ¶è¶å"},
	//----------------------------------------
	{"e     ","¶ï¶í¶ð¶ë¶ì¶ê¶î¶ò¶ó¶ñ¶ö¶õ¶ô"},
	{"en    ","¶÷"},
	{"er    ","¶ù¶ø¶û¶ú¶ý¶ü¶þ·¡"},
	//----------------------------------------
	{"fa    ","·¢·¦·¥·£·§·¤·¨·©"},
	{"fan   ","·«·¬·­·ª·²·¯·°·³·®·±·´·µ·¸·º·¹·¶··"},
	{"fang  ","·½·»·¼·À·Á·¿·¾·Â·Ã·Ä·Å"},
	{"fei   ","·É·Ç·È·Æ·Ê·Ë·Ì·Í·Ï·Ð·Î·Ñ"},
	{"fen   ","·Ö·Ô·×·Ò·Õ·Ó·Ø·Ú·Ù·Û·Ý·Ü·Þ·ß·à"},
	{"feng  ","·á·ç·ã·â·è·å·é·æ·ä·ë·ê·ì·í·ï·î"},
	{"fo    ","·ð"},
	{"fou   ","·ñ"},
	{"fu    ","·ò·ô·õ·ó¸¥·ü·ö·÷·þ·ý·ú¸¡¸¢·û¸¤·ù¸£·ø¸§¸¦¸®¸«¸©¸ª¸¨¸­¸¯¸¸¸¼¸¶¸¾¸º¸½¸À¸·¸´¸°¸±¸µ¸»¸³¸¿¸¹¸²"},
	//----------------------------------------
	{"ga    ","¸Â¸Á"},
	{"gai   ","¸Ã¸Ä¸Æ¸Ç¸È¸Å"},
	{"gan   ","¸É¸Ê¸Ë¸Î¸Ì¸Í¸Ñ¸Ï¸Ò¸Ð¸Ó"},
	{"gang  ","¸Ô¸Õ¸Ú¸Ù¸Ø¸×¸Ö¸Û¸Ü"},
	{"gao   ","¸Þ¸á¸ß¸à¸Ý¸â¸ã¸å¸ä¸æ"},
	{"ge    ","¸ê¸í¸ç¸ì¸ë¸î¸é¸è¸ó¸ï¸ñ¸ð¸ô¸ö¸÷¸õ¿©"},
	{"gei   ","¸ø"},
	{"gen   ","¸ù¸ú"},
	{"geng  ","¸ü¸ý¸û¸þ¹¡¹¢¹£"},
	{"gong  ","¹¤¹­¹«¹¦¹¥¹©¹¬¹§¹ª¹¨¹®¹¯¹°¹²¹±"},
	{"gou   ","¹´¹µ¹³¹·¹¶¹¹¹º¹¸¹»"},
	{"gu    ","¹À¹¾¹Ã¹Â¹Á¹½¹¼¹¿¹Å¹È¹É¹Ç¹Æ¹Ä¹Ì¹Ê¹Ë¹Í"},
	{"gua   ","¹Ï¹Î¹Ð¹Ñ¹Ò¹Ó"},
	{"guai  ","¹Ô¹Õ¹Ö"},
	{"guan  ","¹Ø¹Û¹Ù¹Ú¹×¹Ý¹Ü¹á¹ß¹à¹Þ"},
	{"guang ","¹â¹ã¹ä"},
	{"gui   ","¹é¹ç¹ê¹æ¹ë¹è¹å¹ì¹î¹ï¹í¹ô¹ñ¹ó¹ð¹ò"},
	{"gun   ","¹õ¹ö¹÷"},
	{"guo   ","¹ù¹ø¹ú¹û¹ü¹ý"},
	//----------------------------------------
	{"ha    ","¸ò¹þ"},
	{"hai   ","º¢º¡º£º¥º§º¦º¤"},
	{"han   ","º¨º©º¬ºªº¯º­º®º«º±º°ººº¹ºµº·º´º¸º¶º³º²"},
	{"hang  ","º¼º½ÐÐ"},
	{"hao   ","ºÁºÀº¿º¾ºÃºÂºÅºÆºÄ"},
	{"he    ","ºÇºÈºÌºÏºÎºÍºÓºÒºËºÉºÔºÐºÊºØºÖºÕº×"},
	{"hei   ","ºÚºÙ"},
	{"hen   ","ºÛºÜºÝºÞ"},
	{"heng  ","ºàºßºãºáºâ"},
	{"hong  ","ºäºåºæºëºìºêºéºçºè"},
	{"hou   ","ºîºíºïºðºóºñºò"},
	{"hu    ","ºõºôºö»¡ºüºúºøºþºùº÷ºýºû»¢»£»¥»§»¤»¦"},
	{"hua   ","»¨»ª»©»¬»«»¯»®»­»°"},
	{"huai  ","»³»²»´»±»µ"},
	{"huan  ","»¶»¹»·»¸»º»Ã»Â»½»»»Á»¼»À»¾»¿"},
	{"huang ","»Ä»Å»Ê»Ë»Æ»Ì»Í»È»Ç»É»Ð»Î»Ñ»Ï"},
	{"hui   ","»Ò»Ö»Ó»Ô»Õ»Ø»×»Ú»Ü»ã»á»ä»æ»å»â»ß»Þ»à»Ý»Ù»Û"},
	{"hun   ","»è»ç»é»ë»ê»ì"},
	{"huo   ","»í»î»ð»ï»ò»õ»ñ»ö»ó»ô"},
	//----------------------------------------
	{"ji    ","¼¥»÷¼¢»ø»ú¼¡¼¦¼£¼§»ý»ù¼¨¼©»û»þ»ü¼¤¼°¼ª¼³¼¶¼´¼«¼±¼²¼¬¼¯¼µ¼­¼®¼¸¼º¼·¼¹¼Æ¼Ç¼¿¼Í¼Ë¼É¼¼¼Ê¼Á¼¾¼È¼Ã¼Ì¼Å¼Ä¼Â¼À¼»¼½½å"},
	{"jia   ","¼Ó¼Ð¼Ñ¼Ï¼Ò¼Î¼Ô¼Õ¼×¼Ö¼Ø¼Û¼Ý¼Ü¼Ù¼Þ¼ÚÐ®"},
	{"jian  ","¼é¼â¼á¼ß¼ä¼ç¼è¼æ¼à¼ã¼ê¼å¼ð¼ó¼í¼ë¼ñ¼õ¼ô¼ì¼ï¼ò¼î¼û¼þ½¨½¤½£¼ö¼ú½¡½§½¢½¥½¦¼ù¼ø¼ü¼ý"},
	{"jiang ","½­½ª½«½¬½©½®½²½±½°½¯½³½µ½´"},
	{"jiao  ","½»½¼½¿½½½¾½º½·½¹½¶½¸½Ç½Æ½Ê½È½Ã½Å½Â½Á½Ë½É½Ð½Î½Ï½Ì½Ñ½Í¾õ½À"},
	{"jie   ","½×½Ô½Ó½Õ½Ò½Ö½Ú½Ù½Ü½à½á½Ý½Þ½Ø½ß½ã½â½é½ä½æ½ì½ç½ê½ë½è"},
	{"jin   ","½í½ñ½ï½ð½ò½î½ó½ö½ô½÷½õ¾¡¾¢½ü½ø½ú½þ½ý½û½ù"},
	{"jing  ","¾©¾­¾¥¾£¾ª¾§¾¦¾¬¾¤¾«¾¨¾®¾±¾°¾¯¾»¾¶¾·¾º¾¹¾´¾¸¾³¾²¾µ"},
	{"jiong ","¾¼¾½"},
	{"jiu   ","¾À¾¿¾¾¾Å¾Ã¾Ä¾Á¾Â¾Æ¾É¾Ê¾Ì¾Î¾Ç¾È¾Í¾Ë"},
	{"ju    ","¾Ó¾Ð¾Ñ¾Ô¾Ò¾Ï¾Ö½Û¾Õ¾×¾Ú¾Ù¾Ø¾ä¾Þ¾Ü¾ß¾æ¾ã¾ç¾å¾Ý¾à¾â¾Û¾á"},
	{"juan  ","¾ê¾è¾é¾í¾ë¾î¾ì"},
	{"jue   ","¾ï¾ö¾÷¾ñ¾ø¾ó¾ò¾ô¾ð"},
	{"jun   ","¾ü¾ý¾ù¾û¾ú¿¡¿¤¾þ¿£¿¥¿¢"},
	//----------------------------------------
	{"ka    ","¿§¿¦¿¨"},
	{"kai   ","¿ª¿«¿­¿®¿¬"},
	{"kan   ","¼÷¿¯¿±¿°¿²¿³¿´"},
	{"kang  ","¿µ¿¶¿·¿¸¿º¿¹¿»"},
	{"kao   ","¿¼¿½¿¾¿¿"},
	{"ke    ","¿À¿Á¿Â¿Æ¿Ã¿Å¿Ä¿Ç¿È¿É¿Ê¿Ë¿Ì¿Í¿Î"},
	{"ken   ","¿Ï¿Ñ¿Ò¿Ð"},
	{"keng  ","¿Ô¿Ó"},
	{"kong  ","¿Õ¿×¿Ö¿Ø"},
	{"kou   ","¿Ù¿Ú¿Û¿Ü"},
	{"ku    ","¿Ý¿Þ¿ß¿à¿â¿ã¿á"},
	{"kua   ","¿ä¿å¿æ¿è¿ç"},
	{"kuai  ","¿é¿ì¿ë¿ê"},
	{"kuan  ","¿í¿î"},
	{"kuang ","¿ï¿ð¿ñ¿ö¿õ¿ó¿ò¿ô"},
	{"kui   ","¿÷¿ù¿ø¿ú¿ü¿û¿ý¿þÀ¢À£À¡"},
	{"kun   ","À¤À¥À¦À§"},
	{"kuo   ","À©À¨À«Àª"},
	//----------------------------------------
	{"la    ","À¬À­À²À®À°À¯À±"},
	{"lai   ","À´À³Àµ"},
	{"lan   ","À¼À¹À¸À·À»À¶À¾À½ÀºÀÀÀ¿ÀÂÀÁÀÃÀÄ"},
	{"lang  ","ÀÉÀÇÀÈÀÅÀÆÀÊÀË"},
	{"lao   ","ÀÌÀÍÀÎÀÏÀÐÀÑÀÔÀÓÀÒ"},
	{"le    ","ÀÖÀÕÁË"},
	{"lei   ","À×ÀØÀÝÀÚÀÙÀÜÀßÀáÀàÀÛÀÞ"},
	{"leng  ","ÀâÀãÀä"},
	{"li    ","ÀåÀæÀêÀëÀòÀçÀìÁ§ÀèÀéÀñÀîÀïÁ¨ÀíÀðÁ¦ÀúÀ÷Á¢ÀôÀöÀûÀøÁ¤ÀýÁ¥ÀþÀóÀõÀùÁ£ÀüÁ¡"},
	{"lian  ","Á¬Á±Á¯Á°Á«ÁªÁ®Á­Á²Á³Á·Á¶ÁµÁ´"},
	{"liang ","Á©Á¼Á¹ÁºÁ¸Á»Á½ÁÁÁÂÁ¾ÁÀÁ¿"},
	{"liao  ","ÁÊÁÉÁÆÁÄÁÅÁÈÁÎÁÃÁÇÁÍÁÏÁÌ"},
	{"lie   ","ÁÐÁÓÁÒÁÔÁÑ"},
	{"lin   ","ÁÚÁÖÁÙÁÜÁÕÁØÁ×ÁÛÁÝÁßÁÞÁà"},
	{"ling  ","ÁæÁéÁëÁáÁèÁåÁêÁçÁâÁãÁäÁìÁîÁí"},
	{"liu   ","ÁïÁõÁ÷ÁôÁðÁòÁóÁñÁöÁøÁù"},
	{"long  ","ÁúÁüÁýÁûÂ¡ÁþÂ¤Â¢Â£"},
	{"lou   ","Â¦Â¥Â§Â¨ÂªÂ©"},
	{"lu    ","Â¶Â¬Â®Â«Â¯Â­Â±Â²Â°Â³Â½Â¼Â¸Â¹Â»ÂµÂ·Â¾ÂºÂ´"},
	{"luan  ","ÂÏÂÍÂÎÂÐÂÑÂÒ"},
	{"lue   ","ÂÓÂÔ"},
	{"lun   ","ÂÕÂØÂ×ÂÙÂÚÂÖÂÛ"},
	{"luo   ","ÂÞÂÜÂßÂàÂáÂâÂÝÂãÂåÂçÂæÂä"},
	{"lv    ","ÂËÂ¿ÂÀÂÂÂÃÂÁÂÅÂÆÂÄÂÉÂÇÂÊÂÌÂÈ"},
	//----------------------------------------
	{"ma    ","ÂèÂéÂíÂêÂëÂìÂîÂðÂï"},
	{"mai   ","ÂñÂòÂõÂóÂôÂö"},
	{"man   ","ÂùÂøÂ÷ÂúÂüÃ¡ÂýÂþÂû"},
	{"mang  ","Ã¦Ã¢Ã¤Ã£Ã§Ã¥"},
	{"mao   ","Ã¨Ã«Ã¬Ã©ÃªÃ®Ã­Ã¯Ã°Ã³Ã±Ã²"},
	{"me    ","Ã´"},
	{"mei   ","Ã»Ã¶ÃµÃ¼Ã·Ã½ÃºÃ¸Ã¹Ã¿ÃÀÃ¾ÃÃÃÁÃÄÃÂ"},
	{"men   ","ÃÅÃÆÃÇ"},
	{"meng  ","ÃÈÃËÃÊÃÍÃÉÃÌÃÏÃÎ"},
	{"mi    ","ÃÖÃÔÃÕÃÑÃÓÃÒÃ×ÃÐÃÚÃÙÃØÃÜÃÝÃÛ"},
	{"mian  ","ÃßÃàÃÞÃâÃãÃäÃáÃåÃæ"},
	{"miao  ","ÃçÃèÃéÃëÃìÃêÃîÃí"},
	{"mie   ","ÃðÃï"},
	{"min   ","ÃñÃóÃòÃöÃõÃô"},
	{"ming  ","ÃûÃ÷ÃùÃúÃøÃü"},
	{"miu   ","Ãý"},
	{"mo    ","ºÑÃþÄ¡Ä£Ä¤Ä¦Ä¥Ä¢Ä§Ä¨Ä©Ä­Ä°ÄªÄ¯Ä®Ä«Ä¬"},
	{"mou   ","Ä²Ä±Ä³"},
	{"mu    ","Ä¸Ä¶ÄµÄ·Ä´Ä¾Ä¿ÄÁÄ¼Ä¹Ä»ÄÀÄ½ÄºÄÂ"},
	//----------------------------------------
	{"na    ","ÄÃÄÄÄÇÄÉÄÈÄÆÄÅ"},
	{"nai   ","ÄËÄÌÄÊÄÎÄÍ"},
	{"nan   ","ÄÐÄÏÄÑ"},
	{"nang  ","ÄÒ"},
	{"nao   ","ÄÓÄÕÄÔÄÖÄ×"},
	{"ne    ","ÄØ"},
	{"nei   ","ÄÚÄÙ"},
	{"nen   ","ÄÛ"},
	{"neng  ","ÄÜ"},
	{"ni    ","ÄÝÄáÄàÄßÄÞÄãÄâÄæÄäÄçÄå"},
	{"nian  ","ÄéÄêÄíÄìÄëÄîÄè"},
	{"niang ","ÄïÄð"},
	{"niao  ","ÄñÄò"},
	{"nie   ","ÄóÄùÄôÄöÄ÷ÄøÄõ"},
	{"nin   ","Äú"},
	{"ning  ","ÄþÅ¡ÄüÄûÄýÅ¢"},
	{"niu   ","Å£Å¤Å¦Å¥"},
	{"nong  ","Å©Å¨Å§Åª"},
	{"nu    ","Å«Å¬Å­"},
	{"nuan  ","Å¯"},
	{"nue   ","Å±Å°"},
	{"nuo   ","Å²ÅµÅ³Å´"},
	{"nv    ","Å®"},
	//----------------------------------------
	{"o     ","Å¶"},
	{"ou    ","Å·Å¹Å¸Å»Å¼ÅºÅ½"},
	//----------------------------------------
	{"pa    ","Å¿Å¾ÅÀ°ÒÅÃÅÁÅÂ"},
	{"pai   ","ÅÄÅÇÅÅÅÆÅÉÅÈ"},
	{"pan   ","ÅËÅÊÅÌÅÍÅÐÅÑÅÎÅÏ"},
	{"pang  ","ÅÒÅÓÅÔÅÕÅÖ"},
	{"pao   ","Å×ÅÙÅØÅÚÅÛÅÜÅÝ"},
	{"pei   ","ÅÞÅßÅãÅàÅâÅáÅæÅåÅä"},
	{"pen   ","ÅçÅè"},
	{"peng  ","ÅêÅéÅëÅóÅíÅïÅðÅîÅôÅìÅñÅòÅõÅö"},
	{"pi    ","±ÙÅúÅ÷ÅûÅøÅüÅùÆ¤ÅþÆ£Æ¡ÅýÆ¢Æ¥Æ¦Æ¨Æ§Æ©"},
	{"pian  ","Æ¬Æ«ÆªÆ­"},
	{"piao  ","Æ¯Æ®Æ°Æ±"},
	{"pie   ","Æ²Æ³"},
	{"pin   ","Æ´Æ¶ÆµÆ·Æ¸"},
	{"ping  ","Æ¹Æ½ÆÀÆ¾ÆºÆ»ÆÁÆ¿Æ¼"},
	{"po    ","ÆÂÆÃÆÄÆÅÆÈÆÆÆÉÆÇ"},
	{"pou   ","ÆÊ"},
	{"pu    ","¸¬ÆÍÆËÆÌÆÎÆÐÆÏÆÑÆÓÆÔÆÒÆÖÆÕÆ×ÆØ"},
	//----------------------------------------
	{"qi    ","ÆßÆãÆÞÆâÆàÆÜÆÝÆÚÆÛÆáÆîÆëÆäÆæÆçÆíÆêÆéÆèÆïÆåÆìÆòÆóÆñÆôÆðÆøÆýÆùÆúÆûÆüÆõÆöÆ÷"},
	{"qia   ","ÆþÇ¡Ç¢"},
	{"qian  ","Ç§ÇªÇ¤Ç¨Ç¥Ç£Ç¦Ç«Ç©Ç°Ç®Ç¯Ç¬Ç±Ç­Ç³Ç²Ç´Ç·ÇµÇ¶Ç¸"},
	{"qiang ","ÇºÇ¼Ç¹Ç»Ç¿Ç½Ç¾ÇÀ"},
	{"qiao  ","ÇÄÇÃÇÂÇÁÇÇÇÈÇÅÇÆÇÉÇÎÇÍÇÏÇÌÇËÇÊ"},
	{"qie   ","ÇÐÇÑÇÒÇÓÇÔ"},
	{"qin   ","Ç×ÇÖÇÕÇÛÇØÇÙÇÝÇÚÇÜÇÞÇß"},
	{"qing  ","ÇàÇâÇáÇãÇäÇåÇéÇçÇèÇæÇêÇëÇì"},
	{"qiong ","ÇîÇí"},
	{"qiu   ","ÇðÇñÇïÇôÇóÇöÇõÇò"},
	{"qu    ","ÇøÇúÇýÇüÇùÇûÇ÷ÇþÈ¡È¢È£È¥È¤"},
	{"quan  ","È¦È«È¨ÈªÈ­È¬È©È§È®È°È¯"},
	{"que   ","È²È±È³È´È¸È·ÈµÈ¶"},
	{"qun   ","È¹Èº"},
	//----------------------------------------
	{"ran   ","È»È¼È½È¾"},
	{"rang  ","È¿ÈÂÈÀÈÁÈÃ"},
	{"rao   ","ÈÄÈÅÈÆ"},
	{"re    ","ÈÇÈÈ"},
	{"ren   ","ÈËÈÊÈÉÈÌÈÐÈÏÈÎÈÒÈÑÈÍ"},
	{"reng  ","ÈÓÈÔ"},
	{"ri    ","ÈÕ"},
	{"rong  ","ÈÖÈÞÈ×ÈÙÈÝÈÜÈØÈÛÈÚÈß"},
	{"rou   ","ÈáÈàÈâ"},
	{"ru    ","ÈçÈãÈåÈæÈäÈêÈéÈèÈëÈì"},
	{"ruan  ","ÈîÈí"},
	{"rui   ","ÈïÈñÈð"},
	{"run   ","ÈòÈó"},
	{"ruo   ","ÈôÈõ"},
	//----------------------------------------
	{"sa    ","ÈöÈ÷Èø"},
	{"sai   ","ÈûÈùÈúÈü"},
	{"san   ","ÈýÈþÉ¡É¢"},
	{"sang  ","É£É¤É¥"},
	{"sao   ","É¦É§É¨É©"},
	{"se    ","É«É¬Éª"},
	{"sen   ","É­"},
	{"seng  ","É®"},
	{"sha   ","É±É³É´É°É¯ÉµÉ¶É·ÏÃ"},
	{"shai  ","É¸É¹"},
	{"shan  ","É½É¾É¼ÉÀÉºÉ¿ÉÁÉÂÉÇÉ»ÉÈÉÆÉÉÉÃÉÅÉÄÕ¤"},
	{"shang ","ÉËÉÌÉÊÉÑÉÎÉÍÉÏÉÐ"},
	{"shao  ","ÉÓÉÒÉÕÉÔÉ×ÉÖÉØÉÙÉÛÉÜÉÚ"},
	{"she   ","ÉÝÉÞÉàÉßÉáÉèÉçÉäÉæÉâÉåÉã"},
	{"shen  ","ÉêÉìÉíÉëÉðÉïÉéÉîÉñÉòÉóÉôÉöÉõÉøÉ÷Ê²"},
	{"sheng ","ÉýÉúÉùÉüÊ¤ÉûÉþÊ¡Ê¥Ê¢Ê£"},
	{"shi   ","³×Ê¬Ê§Ê¦Ê­Ê«Ê©Ê¨ÊªÊ®Ê¯Ê±Ê¶ÊµÊ°Ê´Ê³Ê·Ê¸Ê¹Ê¼Ê»ÊºÊ¿ÊÏÊÀÊËÊÐÊ¾Ê½ÊÂÊÌÊÆÊÓÊÔÊÎÊÒÊÑÊÃÊÇÊÁÊÊÊÅÊÍÊÈÊÄÊÉËÆ"},
	{"shou  ","ÊÕÊÖÊØÊ×ÊÙÊÜÊÞÊÛÊÚÊÝ"},
	{"shu   ","ÊéÊãÊåÊàÊâÊáÊçÊèÊæÊäÊßÊëÊêÊìÊîÊòÊðÊóÊñÊíÊïÊõÊùÊøÊöÊ÷ÊúË¡ÊüÊýÊûÊþÊô"},
	{"shua  ","Ë¢Ë£"},
	{"shuai ","Ë¥Ë¤Ë¦Ë§"},
	{"shuan ","Ë©Ë¨"},
	{"shuang","Ë«ËªË¬"},
	{"shui  ","Ë­Ë®Ë°Ë¯"},
	{"shun  ","Ë±Ë³Ë´Ë²"},
	{"shuo  ","ËµË¸Ë·Ë¶"},
	{"si    ","Ë¿Ë¾Ë½Ë¼Ë¹Ë»ËºËÀËÈËÄËÂËÅËÇËÃËÁ"},
	{"song  ","ËÉËËËÊËÏËÎËÐËÍËÌ"},
	{"sou   ","ËÔËÑËÒËÓ"},
	{"su    ","ËÕËÖË×ËßËàËØËÙËÚËÜËÝËÛ"},
	{"suan  ","ËáËâËã"},
	{"sui   ","ËäËçËåËæËèËêËîËìËéËíËë"},
	{"sun   ","ËïËðËñ"},
	{"suo   ","ËôËóËòËõËùË÷ËöËø"},
	//----------------------------------------
	{"ta    ","ËýËûËüËúËþÌ¡Ì¢Ì¤Ì£"},
	{"tai   ","Ì¥Ì¨Ì§Ì¦Ì«Ì­Ì¬Ì©Ìª"},
	{"tan   ","Ì®Ì°Ì¯Ì²Ì±Ì³Ì¸ÌµÌ·Ì¶Ì´Ì¹Ì»ÌºÌ¾Ì¿Ì½Ì¼"},
	{"tang  ","ÌÀÌÆÌÃÌÄÌÁÌÂÌÅÌÇÌÈÌÊÌÉÌÌÌË"},
	{"tao   ","ÌÎÌÐÌÍÌÏÌÓÌÒÌÕÌÔÌÑÌÖÌ×"},
	{"te    ","ÌØ"},
	{"teng  ","ÌÛÌÚÌÜÌÙ"},
	{"ti    ","ÌÞÌÝÌàÌßÌäÌáÌâÌãÌåÌëÌêÌéÌèÌæÌç"},
	{"tian  ","ÌìÌíÌïÌñÌðÌîÌóÌò"},
	{"tiao  ","µ÷ÌôÌõÌöÌ÷Ìø"},
	{"tie   ","ÌùÌúÌû"},
	{"ting  ","ÌüÍ¡ÌýÌþÍ¢Í¤Í¥Í£Í¦Í§"},
	{"tong  ","Í¨Í¬Í®Í©Í­Í¯ÍªÍ«Í³Í±Í°Í²Í´"},
	{"tou   ","ÍµÍ·Í¶Í¸"},
	{"tu    ","Í¹ÍºÍ»Í¼Í½Í¿Í¾ÍÀÍÁÍÂÍÃ"},
	{"tuan  ","ÍÄÍÅ"},
	{"tui   ","ÍÆÍÇÍÈÍËÍÉÍÊ"},
	{"tun   ","¶ÚÍÌÍÍÍÎ"},
	{"tuo   ","ÍÐÍÏÍÑÍÔÍÓÍÕÍÒÍ×ÍÖÍØÍÙ"},
	//----------------------------------------
	{"wa    ","ÍÛÍÞÍÚÍÝÍÜÍßÍà"},
	{"wai   ","ÍáÍâ"},
	{"wan   ","ÍäÍåÍãÍèÍêÍæÍçÍéÍðÍìÍíÍñÍïÍîÍëÍòÍó"},
	{"wang  ","ÍôÍöÍõÍøÍùÍ÷ÍýÍüÍúÍû"},
	{"wei   ","Î£ÍþÎ¢Î¡ÎªÎ¤Î§Î¥Î¦Î¨Î©Î¬Î«Î°Î±Î²Î³Î­Î¯Î®ÎÀÎ´Î»Î¶Î·Î¸Î¾Î½Î¹Î¼ÎµÎ¿Îº"},
	{"wen   ","ÎÂÎÁÎÄÎÆÎÅÎÃÎÇÎÉÎÈÎÊ"},
	{"weng  ","ÎÌÎËÎÍ"},
	{"wo    ","ÎÎÎÐÎÑÎÏÎÒÎÖÎÔÎÕÎÓ"},
	{"wu    ","ÎÚÎÛÎØÎ×ÎÝÎÜÎÙÎÞÎãÎâÎáÎßÎàÎåÎçÎéÎëÎäÎêÎæÎèÎðÎñÎìÎïÎóÎòÎîÎí"},
	//----------------------------------------
	{"xi    ","Ï¦Ï«Î÷ÎüÏ£ÎôÎöÎùÏ¢ÎþÏ¤Ï§Ï©ÎøÎúÏ¬Ï¡ÏªÎýÏ¨ÎõÎûÏ¥Ï°Ï¯Ï®Ï±Ï­Ï´Ï²Ï·ÏµÏ¸Ï¶"},
	{"xia   ","ÏºÏ¹Ï»ÏÀÏ¿ÏÁÏ¾Ï½Ï¼ÏÂÏÅÏÄ"},
	{"xian  ","Ï³ÏÉÏÈÏËÏÆÏÇÏÊÏÐÏÒÏÍÏÌÏÑÏÏÏÎÏÓÏÔÏÕÏØÏÖÏßÏÞÏÜÏÝÏÚÏÛÏ×ÏÙ"},
	{"xiang ","ÏçÏàÏãÏáÏæÏäÏåÏâÏêÏéÏèÏíÏìÏëÏòÏïÏîÏóÏñÏð"},
	{"xiao  ","ÏüÏûÏôÏõÏúÏöÏùÏýÐ¡ÏþÐ¢Ð¤ÏøÐ§Ð£Ð¦Ð¥"},
	{"xie   ","Ð©Ð¨ÐªÐ«Ð­Ð°Ð²Ð±Ð³Ð¯Ð¬Ð´Ð¹ÐºÐ¶Ð¼ÐµÐ»Ð¸Ð·"},
	{"xin   ","ÐÄÐÃÐ¾ÐÁÐÀÐ¿ÐÂÐ½ÐÅÐÆ"},
	{"xing  ","ÐËÐÇÐÊÐÉÐÈÐÌÐÏÐÎÐÍÐÑÐÓÐÕÐÒÐÔ"},
	{"xiong ","Ð×ÐÖÐÙÐÚÐØÐÛÐÜ"},
	{"xiu   ","ËÞÐÝÐÞÐßÐàÐãÐåÐäÐâÐá"},
	{"xu    ","ÐçÐëÐéÐêÐèÐæÐìÐíÐñÐòÐðÐôÐ÷ÐøÐïÐöÐõÐîÓõ"},
	{"xuan  ","ÐùÐûÐúÐþÐüÐýÑ¡Ñ¢Ñ¤Ñ£"},
	{"xue   ","Ï÷Ñ¥Ñ¦Ñ¨Ñ§Ñ©Ñª"},
	{"xun   ","Ñ«Ñ¬Ñ°Ñ²Ñ®Ñ±Ñ¯Ñ­ÑµÑ¶Ñ´Ñ¸Ñ·Ñ³"},
	//----------------------------------------
	{"ya    ","Ñ¾Ñ¹Ñ½ÑºÑ»Ñ¼ÑÀÑ¿ÑÁÑÂÑÄÑÃÑÆÑÅÑÇÑÈ"},
	{"yan   ","ÑÊÑÌÑÍÑÉÑËÑÓÑÏÑÔÑÒÑØÑ×ÑÐÑÎÑÖÑÑÑÕÑÙÑÜÑÚÑÛÑÝÑáÑåÑâÑäÑçÑÞÑéÑèÑßÑæÑãÑà"},
	{"yang  ","ÑëÑêÑíÑìÑïÑòÑôÑîÑðÑñÑóÑöÑøÑõÑ÷ÑùÑú"},
	{"yao   ","½ÄÑýÑüÑûÒ¢Ò¦Ò¤Ò¥Ò¡Ò£ÑþÒ§Ò¨Ò©ÒªÒ«Ô¿"},
	{"ye    ","Ò¬Ò­Ò¯Ò®Ò²Ò±Ò°ÒµÒ¶Ò·Ò³Ò¹Ò´ÒºÒ¸"},
	{"yi    ","Ò»ÒÁÒÂÒ½ÒÀÒ¿Ò¼Ò¾ÒÇÒÄÒÊÒËÒÌÒÈÒÆÒÅÒÃÒÉÒÍÒÒÒÑÒÔÒÓÒÏÒÐÒÎÒåÒÚÒäÒÕÒéÒàÒÙÒìÒÛÒÖÒëÒØÒ×ÒïÒèÒßÒæÒêÒîÒÝÒâÒçÒÞÒáÒãÒíÒÜ"},
	{"yin   ","ÒòÒõÒöÒðÒñÒôÒóÒ÷ÒúÒùÒøÒüÒýÒûÒþÓ¡"},
	{"ying  ","Ó¦Ó¢Ó¤Ó§Ó£Ó¥Ó­Ó¯Ó«Ó¨Ó©ÓªÓ¬Ó®Ó±Ó°Ó³Ó²"},
	{"yo    ","Ó´"},
	{"yong  ","Ó¶ÓµÓ¸Ó¹ÓºÓ·ÓÀÓ½Ó¾ÓÂÓ¿ÓÁÓ¼Ó»ÓÃ"},
	{"you   ","ÓÅÓÇÓÄÓÆÓÈÓÉÓÌÓÊÓÍÓËÓÎÓÑÓÐÓÏÓÖÓÒÓ×ÓÓÓÕÓÔ"},
	{"yu    ","ÓØÓÙÓåÓÚÓèÓàÓÛÓãÓáÓéÓæÓçÓäÓâÓÞÓÜÓÝÓßÓëÓîÓìÓðÓêÓíÓïÓñÔ¦ÓóÓýÓôÓüÓøÔ¡Ô¤ÓòÓûÓ÷Ô¢ÓùÔ£ÓöÓúÓþÔ¥"},
	{"yuan  ","Ô©Ô§Ô¨ÔªÔ±Ô°Ô«Ô­Ô²Ô¬Ô®ÔµÔ´Ô³Ô¯Ô¶Ô·Ô¹ÔºÔ¸"},
	{"yue   ","Ô»Ô¼ÔÂÔÀÔÃÔÄÔ¾ÔÁÔ½"},
	{"yun   ","ÔÆÔÈÔÇÔÅÔÊÔÉÔÐÔËÔÎÔÍÔÏÔÌ"},
	//----------------------------------------
	{"za    ","ÔÑÔÓÔÒÕ¦"},
	{"zai   ","ÔÖÔÕÔÔÔ×ÔØÔÙÔÚ×Ð"},
	{"zan   ","ÔÛÔÜÔÝÔÞ"},
	{"zang  ","ÔßÔàÔá"},
	{"zao   ","ÔâÔãÔäÔçÔæÔéÔèÔåÔîÔíÔìÔëÔïÔê"},
	{"ze    ","ÔòÔñÔóÔð"},
	{"zei   ","Ôô"},
	{"zen   ","Ôõ"},
	{"zeng  ","ÔöÔ÷Ôù"},
	{"zha   ","ÔûÔüÔúÔýÔþÕ¢Õ¡Õ£Õ§Õ©Õ¨Õ¥×õ"},
	{"zhai  ","Õ«ÕªÕ¬µÔÕ­Õ®Õ¯"},
	{"zhan  ","Õ´Õ±Õ³Õ²Õ°Õ¶Õ¹ÕµÕ¸Õ·Õ¼Õ½Õ»Õ¾ÕÀÕ¿Õº"},
	{"zhang ","³¤ÕÅÕÂÕÃÕÄÕÁÕÇÕÆÕÉÕÌÕÊÕÈÕÍÕËÕÏÕÎ"},
	{"zhao  ","ÕÐÕÑÕÒÕÓÕÙÕ×ÕÔÕÕÕÖÕØ×¦"},
	{"zhe   ","ÕÚÕÛÕÜÕÝÕÞÕßÕàÕâÕãÕá×Å"},
	{"zhen  ","ÕêÕëÕìÕäÕæÕèÕåÕçÕéÕïÕíÕîÕóÕñÕòÕðÖ¡"},
	{"zheng ","ÕùÕ÷ÕúÕõÕøÕöÕôÕüÕûÕýÖ¤Ö£ÕþÖ¢"},
	{"zhi   ","Ö®Ö§Ö­Ö¥Ö¨Ö¦ÖªÖ¯Ö«Ö¬Ö©Ö´Ö¶Ö±ÖµÖ°Ö²Ö³Ö¹Ö»Ö¼Ö·Ö½Ö¸ÖºÖÁÖ¾ÖÆÖÄÖÎÖËÖÊÖÅÖ¿ÖÈÖÂÖÀÖÌÖÏÖÇÖÍÖÉÖÃ"},
	{"zhong ","ÖÐÖÒÖÕÖÑÖÓÖÔÖ×ÖÖÖÙÖÚÖØ"},
	{"zhou  ","ÖÝÖÛÖßÖÜÖÞÖàÖáÖâÖãÖäÖæÖçÖåÖè"},
	{"zhu   ","ÖìÖïÖêÖéÖîÖíÖëÖñÖòÖðÖ÷ÖôÖóÖöÖõ×¡Öú×¢Öü×¤Öù×£ÖøÖûÖþÖý"},
	{"zhua  ","×¥"},
	{"zhuai ","×§"},
	{"zhuan ","×¨×©×ª×«×­"},
	{"zhuang","×±×¯×®×°×³×´´±×²"},
	{"zhui  ","×·×µ×¶×¹×º×¸"},
	{"zhun  ","×»×¼"},
	{"zhuo  ","×¿×¾×½×À×Æ×Â×Ç×Ã×Ä×Á"},
	{"zi    ","×Î×È×É×Ë×Ê×Í×Ì×Ñ×Ó×Ï×Ò×Ö×Ô×Õ"},
	{"zong  ","×Ú×Û×Ø×Ù×××Ü×Ý"},
	{"zou   ","×Þ×ß×à×á"},
	{"zu    ","×â×ã×ä×å×ç×è×é×æ"},
	{"zuan  ","×¬×ë×ê"},
	{"zui   ","×ì×î×ï×í"},
	{"zun   ","×ð×ñ"},
	{"zuo   ","×ò×ó×ô×÷×ø×ù×ö"},
	0
};

char *Find_PY(char py_input[])
{
	unsigned int  i;
	unsigned char j,len,isFind ;

	len = strlen(py_input) ;					// ÊäÈë×Ö·û´®µÄ³¤¶È
	if( len==0)  
		return 0;						// Èç¹ûÊäÈë¿Õ×Ö·û·µ»Ø0 
	
	for( i = 0; PYCode[i].py[0]; i++ )	// °´Ë³ÐòÓëÆ´Òô×Ö¿â±È½Ï
	{
		isFind = 1; 
		for( j = 0; j < len; j++ )
		{
			if( PYCode[i].py[j]!= py_input[j] )
			{
				isFind= 0 ;
				break ;			
			}
		}
		if( isFind )
			return PYCode[i].hz ;			// ÕÒµ½¶ÔÓ¦µÄ´®
	}
	return 0;								// ÕÒ²»µ½¶ÔÓ¦µÄ´®
}

